app/controllers/characters_controller.rb

SELECT * FROM "characters"
---
  def index
    @characters = Character.all

SELECT * FROM "characters" WHERE ("characters"."id" = 3)
---
  def show
    @character = Character.find(params[:id])

SELECT * FROM "races" WHERE ("races"."id" = 0) LIMIT 1
INSERT INTO "characters" ("name", "strength", "dexterity", "constitution", "intelegence", "wisdom", "charisma", "created_at", "updated_at", "race_id") VALUES(NULL, 10, 10, 10, 10, 10, 10, '2010-05-03 09:30:34.509053', '2010-05-03 09:30:34.509053', NULL) RETURNING "id"
INSERT INTO "races" ("name", "str_mod", "dex_mod", "con_mod", "int_mod", "wis_mod", "cha_mod", "any") VALUES(E'Half-Elf', 0, 0, 0, 0, 0, 0, 't') RETURNING "id"
---
  def new
    @character = Character.new
		@races = Race.find(:all, :order => "name").map {|u| [u.name, u.id]}
		@character.race = Race.find_by_id 1
		@character.strength = 10
		@character.dexterity = 10
		@character.constitution = 10
		@character.intelegence = 10
		@character.wisdom = 10
		@character.charisma = 10

		@character.save

INSERT INTO "characters" ("name", "strength", "dexterity", "constitution", "intelegence", "wisdom", "charisma", "created_at", "updated_at", "race_id") VALUES(E'1', 10, 10, 10, 10, 10, 10, '2010-03-08 15:33:41.357516', '2010-03-08 15:33:41.357516', NULL) RETURNING "id"
---
  def create
    @character = Character.new(params[:character])

    respond_to do |format|
      if @character.save

SELECT * FROM "characters" WHERE ("characters"."id" = 3)
UPDATE "characters" SET "name" = E'', "race_id" = 1, "strength" = 18, "dexterity" = 11, "constitution" = 9, "intelegence" = 11, "wisdom" = 11, "updated_at" = '2010-05-03 11:46:04.681725' WHERE "id" = 59
---
  def update
    @character = Character.find(params[:id])

    respond_to do |format|
      if @character.update_attributes(params[:character])

SELECT * FROM "characters" WHERE ("characters"."id" = 1)
DELETE FROM "characters" WHERE "id" = 1
---
  def destroy
    @character = Character.find(params[:id])
    @character.destroy

SELECT * FROM "characters" WHERE ("characters"."id" = 78)
UPDATE "characters" SET "constitution" = 11, "updated_at" = '2010-05-03 14:26:34.965803' WHERE "id" = 97
---
  def stat_inc
    @character = Character.find(params[:id])
    stat = @character.send(params[:stat])
    stat = stat + 1 if stat < 18
    @character.write_attribute(params[:stat], stat)
    @character.save

SELECT * FROM "characters" WHERE ("characters"."id" = 72)
UPDATE "characters" SET "constitution" = 12, "updated_at" = '2010-05-03 14:26:41.795803' WHERE "id" = 97
---
  def stat_dec
    @character = Character.find(params[:id])
    stat = @character.send(params[:stat])
    stat = stat - 1 if stat > 7
    @character.write_attribute(params[:stat], stat)
    @character.save

SELECT * FROM "characters" WHERE ("characters"."id" = E'100') LIMIT 1
---
  def update_points
    @character = Character.find_by_id(params[:id])

SELECT * FROM "characters" WHERE ("characters"."id" = E'129') LIMIT 1
SELECT * FROM "races" WHERE ("races"."id" IS NULL) LIMIT 1
UPDATE "characters" SET "race_id" = 3, "updated_at" = '2010-05-03 15:22:02.635638' WHERE "id" = 129
---
  def update_race
    @character = Character.find_by_id(params[:id])
    @character.race = Race.find_by_id(params[:race_id])
    @character.save